code/openfoam/tutorials/XiFluid/1D/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [velocity];

internalField
{
    type        zonal;

    defaultValue    (-1.5 0 0);

    zones
    {
        burnt
        {
            type            box;

            box             (0 -1 -1) (0.025 1 1);

            value           (-10 0 0);
        }
    }
}

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (-1.5 0 0);
    }

    outlet
    {
        type            zeroGradient;
    }

    sides
    {
        type            empty;
    }
}

// ************************************************************************* //
